Catalogs/МИКО_ДополнительныеАТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>МИКО_ДополнительныеАТС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>id_pbx</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортСервера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсCDR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РесурсCEL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/МИКО_ДополнительныеАТС/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если Объект.Ссылка.Пустая() Тогда

		мод_стЗагрузкаИсторииЗвонков_v7 = Вычислить("МИКО_стЗагрузкаИсторииЗвонков_v7");
		МассивАТС = мод_стЗагрузкаИсторииЗвонков_v7.ОпределитьПараметрыАТС();
	    Индекс = 0;
		Пока Индекс < МассивАТС.Количество() Цикл
			АдресАТС = МассивАТС[Индекс].Получить("АдресСервера");
			ПортАТС  = МассивАТС[Индекс].Получить("ПортСервера");
			
			Если Объект.АдресСервера = АдресАТС И Объект.ПортСервера = ПортАТС Тогда
				Сообщить("АТС с таким адресом и номером порта уже созадана.");
				Отказ = Истина;
				Возврат;
			КонецЕсли; 
			
			Индекс = Индекс + 1;	
		КонецЦикла;
	
		Объект.id_pbx = Вернуть_id_pbx();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция Вернуть_id_pbx()
	id_pbx = ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.id_pbx();
	ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.id_pbx(id_pbx+1);
	Возврат ПланыВидовХарактеристик.МИКО_стНастройкиТелефонии.id_pbx();
КонецФункции // ()
